:PROPERTIES:
:ID: 41576369-A684-4BC4-AF5E-32ECDAADAA7C
:END:
#+title: List accounts on Tenant
#+description: List accounts on Tenant
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:tenants:
#+created: 2026-05-21
#+updated: 2026-05-21

    :PROPERTIES:
    :header-args+: :var login_args="--login-username newuser60@acme.com"
    :END:

#+name: list-accounts-tenant
#+begin_src ores-shell :exports none
accounts list
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<list-accounts-tenant>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser60
  Tenant: ACME Corp (76bd1fef-6734-4a4e-b894-cfb7445d337f)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✗ Authorization failed
ores-shell> Bye!
#+end_example
